app/controllers/members_controller.rb

SELECT `members`.* FROM `members`
---
  def index
    @members = Member.all

SELECT `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
---
  def show
    @member = Member.find(params[:id])

SELECT `users`.* FROM `users`
SELECT `members`.* FROM `members`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def new
    @member = Member.new
    @users = User.all
    @members = Member.all
    @members.each do |mem|
      if !mem.user_id.nil?
        @user = User.find(mem.user_id)

INSERT INTO `members` (`created_at`, `info`, `name`, `surname`, `updated_at`, `user_id`) VALUES ('2013-05-23 17:00:49', 'info', 'athomus', 'athomus', '2013-05-23 17:00:49', 1)
---
  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save