app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `created_at`, `project_id`, `title`, `updated_at`) VALUES ('jsgjfhsdjkfhjsdhf', '2013-05-23 17:06:31', NULL, 'Pierwszy p[ost', '2013-05-23 17:06:31')