webowe/app/controllers/awards_controller.rb

SELECT `awards`.* FROM `awards`
---
  def index
    @awards = Award.all

SELECT `awards`.* FROM `awards` WHERE `awards`.`id` = 1 LIMIT 1
---
  def show
    @award = Award.find(params[:id])

SELECT `projects`.* FROM `projects`
---
  def new
    @award = Award.new
    @projects = Project.all

SELECT `projects`.* FROM `projects`
SELECT `awards`.* FROM `awards` WHERE `awards`.`id` = 1 LIMIT 1
---
  def edit
    @projects = Project.all
    @award = Award.find(params[:id])

INSERT INTO `awards` (`created_at`, `info`, `name`, `project_id`, `updated_at`) VALUES ('2013-05-26 21:07:46', 'test award1', 'award1', 1, '2013-05-26 21:07:46')
---
  def create
    @award = Award.new(params[:award])

    respond_to do |format|
      if @award.save