webowe/app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
    @posts = @project.posts
    @awards = @project.awards
    @sponsors = @project.sponsors
    @partners = @project.partners
    @team = Team.where("project_id = ?", @project.id).first
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `awards`.* FROM `awards` WHERE `awards`.`project_id` = 1
SELECT `partners`.* FROM `partners` INNER JOIN `partner_projects` ON `partners`.`id` = `partner_projects`.`partner_id` WHERE `partner_projects`.`project_id` = 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`project_id` = 1
SELECT `sponsors`.* FROM `sponsors` INNER JOIN `sponsor_projects` ON `sponsors`.`id` = `sponsor_projects`.`sponsor_id` WHERE `sponsor_projects`.`project_id` = 1

  def new
    @project = Project.new
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def edit
    @project = Project.find(params[:id])
    @categories = Category.all
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`category_id`, `created_at`, `description`, `name`, `short_desc`, `updated_at`) VALUES (NULL, '2013-05-23 16:58:23', 'desc desc desc', 'Test', 'short', '2013-05-23 16:58:23')