webowe/app/controllers/teams_controller.rb

SELECT `teams`.* FROM `teams`
---
  def index
    @teams = Team.all

SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
---
  def show
    @team = Team.find(params[:id])

SELECT `projects`.* FROM `projects`
---
  def new
    @team = Team.new
    @projects = Project.all

INSERT INTO `teams` (`created_at`, `info`, `project_id`, `updated_at`) VALUES ('2013-05-23 17:02:17', 'info', 1, '2013-05-23 17:02:17')
---
  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save