webowe/app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `login`, `password`, `updated_at`) VALUES ('2013-05-23 16:59:47', 'athomus@o2.pl', 'athomus', 'athomus', '2013-05-23 16:59:47')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save